# web - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.user_pool_id: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Read complete after 1s [id=gateway_api_endpoint]
module.common_resources.data.aws_ssm_parameter.user_pool_id: Read complete after 1s [id=user_pool_id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.aws_cognito_user_pool_client.default will be created
  + resource "aws_cognito_user_pool_client" "default" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "http://localhost:3000/api/auth/callback/cognito",
          + "https://new-staging.connectilly.com/api/auth/callback/cognito",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = true
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "staging_web"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (sensitive value)
      + write_attributes                              = (known after apply)
    }

  # module.common_resources.random_password.nextauthsecret will be created
  + resource "random_password" "nextauthsecret" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 256
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.common_resources.vercel_deployment.default will be created
  + resource "vercel_deployment" "default" {
      + domains     = (known after apply)
      + files       = {
          + "../../../.eslintrc.json"                                          = "40~75e677e7192205173354ae9375c1d25ef78b0cec"
          + "../../../Dockerfile"                                              = "622~87f42718dbe51de66fa9ce8f7d13c9cd5e201091"
          + "../../../README.md"                                               = "1751~48b384309a1437a218793ea183aa2964b6d8d16d"
          + "../../../infrastructure/workspaces/common/outputs.tf"             = "217~d359eda6f62d0b7c19e390cacae394a151a04dcf"
          + "../../../infrastructure/workspaces/common/variables.tf"           = "169~567e81bf0a78e486c49f7ec76d8ea0655d52a648"
          + "../../../infrastructure/workspaces/common_resources/locals.tf"    = "119~6c0bdc825d3f60d23b63a5975bae6ac36fc59097"
          + "../../../infrastructure/workspaces/common_resources/resources.tf" = "2981~e9f372ce0b4fd26b688cd37b4295153157462bd0"
          + "../../../infrastructure/workspaces/common_resources/terraform.tf" = "278~a530fc09a215668de7b7ad649af60c34cf085435"
          + "../../../infrastructure/workspaces/common_resources/variables.tf" = "85~fea626a48e22b0cb7ff8bcb67c4067d8bdd3eeb5"
          + "../../../infrastructure/workspaces/production/locals.tf"          = "40~fea7b9f1c9224cdac47f3656aa21f4d5fa518639"
          + "../../../infrastructure/workspaces/production/main.tf"            = "304~73f26b0e907ea9401851cc30c24a03b9dd6759eb"
          + "../../../infrastructure/workspaces/production/providers.tf"       = "120~e89b51d9a60c234575820b3df5ceb56b99627ea8"
          + "../../../infrastructure/workspaces/production/terraform.tf"       = "380~2efb3c1937ea46c5e49867e23c3f45a37ab726c0"
          + "../../../infrastructure/workspaces/production/variables.tf"       = "208~b9fb6a62596cd06505bfcb80efd82ddddf03bffb"
          + "../../../infrastructure/workspaces/staging/locals.tf"             = "37~529b2583b0fabccefabd226db19f2b54e7743992"
          + "../../../infrastructure/workspaces/staging/main.tf"               = "304~73f26b0e907ea9401851cc30c24a03b9dd6759eb"
          + "../../../infrastructure/workspaces/staging/providers.tf"          = "120~e89b51d9a60c234575820b3df5ceb56b99627ea8"
          + "../../../infrastructure/workspaces/staging/terraform.tf"          = "377~86c808108a257e9f47d989d98e4f6b6706129106"
          + "../../../infrastructure/workspaces/staging/variables.tf"          = "208~b9fb6a62596cd06505bfcb80efd82ddddf03bffb"
          + "../../../next-i18next.config.js"                                  = "83~138ceb181e0eb4c27ef445a6cc1b17b41ce52fe8"
          + "../../../next.config.js"                                          = "196~c54f2500540f70182a49e0df0744e257ec19d17d"
          + "../../../package.json"                                            = "1313~389836f90f77c64c2ebcf9e68574c7d7ecddd767"
          + "../../../public/favicon.ico"                                      = "10361~6aad3b7c34c152a37cfe9a847d620babf2525d81"
          + "../../../public/locales/en/common.json"                           = "50~07dde893ee049067c2b720cf1c7b55f0ed1605c7"
          + "../../../relay.config.js"                                         = "260~a964b0222bcd08baa0417d81c47d943624d8f9b1"
          + "../../../src/pages/_app.tsx"                                      = "559~54c6d01f81eea6d20eddb6f1026ea76ec3250773"
          + "../../../src/pages/_document.tsx"                                 = "233~8d05897613ea6b3a88b92fda34698c305029fc8f"
          + "../../../src/pages/api/auth/[...nextauth].ts"                     = "411~0e6e553b4e9eaed12d277be718afa463902adb50"
          + "../../../src/pages/index.tsx"                                     = "1280~18831be6e890220b34d062843ecbdb968e2f538e"
          + "../../../src/styles/Home.module.css"                              = "3856~0aca80d20664c5ba5c7f3de1aa44b40c7b2d5db6"
          + "../../../src/styles/globals.css"                                  = "2024~e3b15e17e0f8297a45df3fcb9a3a6389bae1bb48"
          + "../../../src/styles/theme/index.ts"                               = "171~8c20c1be1bf090847141cac160497f945ecd263a"
          + "../../../src/types/environment.d.ts"                              = "189~00b2de0ff4a8acdb1c1e6c7ab363b08f302afbd1"
          + "../../../tsconfig.json"                                           = "556~5137f09e9ab161470edd38cb8c5813aa511a5770"
          + "../../../yarn.lock"                                               = "131088~516d58e43f02cbca35a0d66efa4f62ff200ed483"
        }
      + id          = (known after apply)
      + path_prefix = "../../../"
      + production  = true
      + project_id  = (known after apply)
      + team_id     = "connectilly"
      + url         = (known after apply)
    }

  # module.common_resources.vercel_project.default will be created
  + resource "vercel_project" "default" {
      + environment                = (sensitive value)
      + framework                  = "nextjs"
      + id                         = (known after apply)
      + name                       = "staging-web"
      + serverless_function_region = (known after apply)
      + team_id                    = "connectilly"
    }

  # module.common_resources.vercel_project_domain.default will be created
  + resource "vercel_project_domain" "default" {
      + domain     = "new-staging.connectilly.com"
      + id         = (known after apply)
      + project_id = (known after apply)
      + team_id    = "connectilly"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*